content-org/blog.org
#+TITLE: EmacsCast Episodes
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog
#+SEQ_TODO: TODO DONE
#+PROPERTY: header-args :eval never-export
#+OPTIONS: creator:t toc:nil

** DONE Episode 9: Writing in Emacs and Org mode, part 2
CLOSED: [2019-04-22 Mon 18:22]
:PROPERTIES:
:EXPORT_FILE_NAME: episode_9
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :file_id "1ba6bf32-02fa-4ab1-bbb8-8713720f608f", :youtube_id "yTUpJ0oOFzA", :reddit_url "https://reddit.com/r/emacs/comments/bg4diq/emacscast_9_writing_in_emacs_and_org_mode_part_2/"
:END:

Let's continue talking about writing short and long texts in Emacs. This is part 2 of 2. See [[/episode_8/][part 1]].

*** Shownotes

**** Intro
- My talk [[https://www.youtube.com/watch?v=Uij-BvG_f58][Decentralized evolutionary computation with Clojure and ClojureScript]]
**** Config news
- [[https://old.reddit.com/r/emacs/comments/b0jzy4/emacscast_8_writing_in_emacs_and_org_mode_part_1/eikvm97/][fritzgrabo's helpful comment]]
- Make counsel-git see untracked files:  =(setq counsel-git-cmd "git ls-files --full-name --exclude-standard --others --cached --")=
- [[https://www.youtube.com/watch?v=CTOhosGQ2f0][My Emacs workflow]] video
- [[https://old.reddit.com/r/emacs/comments/b0jzy4/emacscast_8_writing_in_emacs_and_org_mode_part_1/eiiywwm/][celeritasCelery's project.el + counsel.git]] solution to project navigation
- [[https://tonsky.me/][Nikita Prokopov]]
- [[https://grumpy.website/][grumpy.website]]
- Consider [[https://www.patreon.com/abo_abo][supporting Oleh Krehel (abo-abo) on Patreon]]. He created and maintains swiper, hydra, lispy, avy and many other [[https://github.com/abo-abo][awesome extensions]].
- [[https://emacscast.org/episode_5/][Episode 5 of EmacsCast]] that includes the description of my move from Helm to Ivy
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Visual-Line-Mode.html][Visual Line Mode]]
- [[https://oremacs.com/2019/04/07/swiper-isearch/][Swiper-isearch - a more isearch-like swiper]]
**** Writing
- [[https://orgmode.org/manual/Structure-editing.html][Structure editing in org]] (including narrowing and widening)
- [[https://github.com/balddotcat/ox-slimhtml][ox-slimhtml]]
- [[https://github.com/freetonik/emacs-dotfiles#slim-html-export][Snippet: copy org as html into clipboard]]
- [[https://github.com/jrblevin/markdown-mode][Markdown mode]]
- [[https://github.com/freetonik/emacs-dotfiles#markdown][Snipper: copy Markdown as html into clipboard]]
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Spelling.html][Checking and Correcting Spelling]]
- [[https://github.com/SavchenkoValeriy/emacs-powerthesaurus][Powerthesaurus integration]]

