content/blog/episode_9.md
+++
title = "Episode 9: Writing in Emacs and Org mode, part 2"
author = ["Rakhim Davletkaliyev"]
date = 2019-04-22T18:22:00+03:00
draft = false
creator = "Emacs 26.2 (Org mode 9.1.9 + ox-hugo)"
file_id = "1ba6bf32-02fa-4ab1-bbb8-8713720f608f"
youtube_id = "yTUpJ0oOFzA"
reddit_url = "https://reddit.com/r/emacs/comments/bg4diq/emacscast_9_writing_in_emacs_and_org_mode_part_2/"
+++

Let's continue talking about writing short and long texts in Emacs. This is part 2 of 2. See [part 1](/episode_8/).


## Shownotes {#shownotes}


### Intro {#intro}

-   My talk [Decentralized evolutionary computation with Clojure and ClojureScript](https://www.youtube.com/watch?v=Uij-BvG%5Ff58)


### Config news {#config-news}

-   [fritzgrabo's helpful comment](https://old.reddit.com/r/emacs/comments/b0jzy4/emacscast%5F8%5Fwriting%5Fin%5Femacs%5Fand%5Forg%5Fmode%5Fpart%5F1/eikvm97/)
-   Make counsel-git see untracked files:  `(setq counsel-git-cmd "git ls-files --full-name --exclude-standard --others --cached --")`
-   [My Emacs workflow](https://www.youtube.com/watch?v=CTOhosGQ2f0) video
-   [celeritasCelery's project.el + counsel.git](https://old.reddit.com/r/emacs/comments/b0jzy4/emacscast%5F8%5Fwriting%5Fin%5Femacs%5Fand%5Forg%5Fmode%5Fpart%5F1/eiiywwm/) solution to project navigation
-   [Nikita Prokopov](https://tonsky.me/)
-   [grumpy.website](https://grumpy.website/)
-   Consider [supporting Oleh Krehel (abo-abo) on Patreon](https://www.patreon.com/abo%5Fabo). He created and maintains swiper, hydra, lispy, avy and many other [awesome extensions](https://github.com/abo-abo).
-   [Episode 5 of EmacsCast](https://emacscast.org/episode%5F5/) that includes the description of my move from Helm to Ivy
-   [Visual Line Mode](https://www.gnu.org/software/emacs/manual/html%5Fnode/emacs/Visual-Line-Mode.html)
-   [Swiper-isearch - a more isearch-like swiper](https://oremacs.com/2019/04/07/swiper-isearch/)


### Writing {#writing}

-   [Structure editing in org](https://orgmode.org/manual/Structure-editing.html) (including narrowing and widening)
-   [ox-slimhtml](https://github.com/balddotcat/ox-slimhtml)
-   [Snippet: copy org as html into clipboard](https://github.com/freetonik/emacs-dotfiles#slim-html-export)
-   [Markdown mode](https://github.com/jrblevin/markdown-mode)
-   [Snipper: copy Markdown as html into clipboard](https://github.com/freetonik/emacs-dotfiles#markdown)
-   [Checking and Correcting Spelling](https://www.gnu.org/software/emacs/manual/html%5Fnode/emacs/Spelling.html)
-   [Powerthesaurus integration](https://github.com/SavchenkoValeriy/emacs-powerthesaurus)
